{
  "trust_pilot": [
    {
      "name": "Sam",
      "content": "\"BBCIncorp provided excellent services by timely incorporating our client's company in the Bahamas. Their response time and costs are much better than their competition.\""
    },
    {
      "name": "Mochi",
      "content": "\"Having worked with many agents and local specialists around the world, I can confidentially say my experience with Linda and her team; was the best experience by far. The team at BBCIncorp is knowledgeable, friendly and efficient. I highly recommend this firm to anyone who needs a reliable partner and formation agent.\""
    },
    {
      "name": "Charlie Ellington",
      "content": "\"Fantastic service and communication. A fast and easy turn-around. I choose this company because others from a Google search didn't seem legitimate. For example, asking for a bank transfer and no reviews. With this team I could see the reviews and pay by Paypal for reassurance. I hope this review helps someone pick the team.\""
    },
    {
      "name": "Mahmut T.",
      "content": "\"Just professionals! Good service and trustable. Thanks Laura!\""
    },
    {
      "name": "Jose C.",
      "content": "\"They are very professional, fast and very clear. They are always there to response in the best professional way\""
    },
    {
      "name": "Arman",
      "content": "\"BBCIncorp team was really helpful, despite time zones Linda (contact person) answered all my questions being out of office, minor delays took place due to COVID, despite that I would recommend Company for everyone.\""
    },
    {
      "name": "Rebecca Ho",
      "content": "\"Ms Linda is very helpful and fast response. Great service.\""
    },
    {
      "name": "Denis Valcu",
      "content": "\"5-star deserved! BBCincorp helped me a lot to start my company in Hong Kong and there support is also 5-star! I recommed for all who want to start an offshore company to start with them!\""
    },
    {
      "name": "Venkat",
      "content": "\"BBCIncorp is one of the best consultant with fast response and prompt service provider in HK. We successfully incorporated our company in Hong Kong within a day. Ms.Katy Lee is very responsive and we extremely satisfied with her assistance during the company registration.\""
    },
    {
      "name": "Adrian VB",
      "content": "\"Great advice and extremely helpful staff helped us achieve our company setup and opening of our bank account. Need to add that replies to emails are always timely and will be availing their accounting services as well. 5 Stars!\""
    }
  ]
}
